#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/William-Hashicorp/hashicat-azure/runs/run-Tf8k76jGPV1Y9p3E

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.myresourcegroup: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/virtualNetworks/williamy-vnet]
azurerm_public_ip.catapp-pip: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/publicIPAddresses/williamy-ip]
azurerm_network_security_group.catapp-sg: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/networkSecurityGroups/williamy-sg]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/virtualNetworks/williamy-vnet/subnets/williamy-subnet]
azurerm_network_interface.catapp-nic: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/networkInterfaces/williamy-catapp-nic]
azurerm_network_interface_security_group_association.catapp-nic-sg-ass: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/networkInterfaces/williamy-catapp-nic|/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/networkSecurityGroups/williamy-sg]
azurerm_virtual_machine.catapp: Refreshing state... [id=/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Compute/virtualMachines/williamy-meow]
null_resource.configure-cat-app: Refreshing state... [id=3731480651888772847]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_network_interface.catapp-nic has been deleted
  - resource "azurerm_network_interface" "catapp-nic" {
      - id                            = "/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/networkInterfaces/williamy-catapp-nic" -> null
        name                          = "williamy-catapp-nic"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_network_security_group.catapp-sg has been deleted
  - resource "azurerm_network_security_group" "catapp-sg" {
      - id                  = "/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/networkSecurityGroups/williamy-sg" -> null
        name                = "williamy-sg"
        # (3 unchanged attributes hidden)
    }

  # azurerm_public_ip.catapp-pip has been deleted
  - resource "azurerm_public_ip" "catapp-pip" {
      - fqdn                    = "williamy-meow.centralus.cloudapp.azure.com" -> null
      - id                      = "/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/publicIPAddresses/williamy-ip" -> null
        name                    = "williamy-ip"
        # (7 unchanged attributes hidden)
    }

  # azurerm_resource_group.myresourcegroup has been deleted
  - resource "azurerm_resource_group" "myresourcegroup" {
        id       = "/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop"
      - location = "centralus" -> null
      - name     = "williamy-workshop" -> null
        tags     = {
            "environment" = "Production"
        }
    }

  # azurerm_subnet.subnet has been deleted
  - resource "azurerm_subnet" "subnet" {
      - id                                             = "/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/virtualNetworks/williamy-vnet/subnets/williamy-subnet" -> null
        name                                           = "williamy-subnet"
        # (6 unchanged attributes hidden)
    }

  # azurerm_virtual_network.vnet has been deleted
  - resource "azurerm_virtual_network" "vnet" {
        id                    = "/subscriptions/14692f20-9428-451b-8298-102ed4e39c2a/resourceGroups/williamy-workshop/providers/Microsoft.Network/virtualNetworks/williamy-vnet"
      - name                  = "williamy-vnet" -> null
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_network_interface.catapp-nic will be created
  + resource "azurerm_network_interface" "catapp-nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "centralus"
      + mac_address                   = (known after apply)
      + name                          = "williamy-catapp-nic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "williamy-workshop"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "williamyipconfig"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.catapp-nic-sg-ass will be created
  + resource "azurerm_network_interface_security_group_association" "catapp-nic-sg-ass" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.catapp-sg will be created
  + resource "azurerm_network_security_group" "catapp-sg" {
      + id                  = (known after apply)
      + location            = "centralus"
      + name                = "williamy-sg"
      + resource_group_name = "williamy-workshop"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 101
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTPS"
              + priority                                   = 102
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "HTTP"
              + priority                                   = 100
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
    }

  # azurerm_public_ip.catapp-pip will be created
  + resource "azurerm_public_ip" "catapp-pip" {
      + allocation_method       = "Dynamic"
      + domain_name_label       = "williamy-meow"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "centralus"
      + name                    = "williamy-ip"
      + resource_group_name     = "williamy-workshop"
      + sku                     = "Basic"
    }

  # azurerm_resource_group.myresourcegroup will be created
  + resource "azurerm_resource_group" "myresourcegroup" {
      + id       = (known after apply)
      + location = "centralus"
      + name     = "williamy-workshop"
      + tags     = {
          + "environment" = "Production"
        }
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.10.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "williamy-subnet"
      + resource_group_name                            = "williamy-workshop"
      + virtual_network_name                           = "williamy-vnet"
    }

  # azurerm_virtual_machine.catapp will be created
  + resource "azurerm_virtual_machine" "catapp" {
      + availability_set_id              = (known after apply)
      + delete_data_disks_on_termination = false
      + delete_os_disk_on_termination    = true
      + id                               = (known after apply)
      + license_type                     = (known after apply)
      + location                         = "centralus"
      + name                             = "williamy-meow"
      + network_interface_ids            = (known after apply)
      + resource_group_name              = "williamy-workshop"
      + tags                             = {
          + "Billable"   = "true"
          + "Department" = "devops"
          + "Owner"      = "WilliamYang"
        }
      + vm_size                          = "Standard_B1s"

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }

      + os_profile {
          + admin_password = (sensitive value)
          + admin_username = "hashicorp"
          + computer_name  = "williamy"
          + custom_data    = (known after apply)
        }

      + os_profile_linux_config {
          + disable_password_authentication = false
        }

      + storage_data_disk {
          + caching                   = (known after apply)
          + create_option             = (known after apply)
          + disk_size_gb              = (known after apply)
          + lun                       = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = (known after apply)
          + name                      = (known after apply)
          + vhd_uri                   = (known after apply)
          + write_accelerator_enabled = (known after apply)
        }

      + storage_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04-LTS"
          + version   = "latest"
        }

      + storage_os_disk {
          + caching                   = "ReadWrite"
          + create_option             = "FromImage"
          + disk_size_gb              = (known after apply)
          + managed_disk_id           = (known after apply)
          + managed_disk_type         = "Standard_LRS"
          + name                      = "williamy-osdisk"
          + os_type                   = (known after apply)
          + write_accelerator_enabled = false
        }
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "centralus"
      + name                  = "williamy-vnet"
      + resource_group_name   = "williamy-workshop"
      + subnet                = (known after apply)
      + vm_protection_enabled = false
    }

  # null_resource.configure-cat-app must be replaced
-/+ resource "null_resource" "configure-cat-app" {
      ~ id       = "3731480651888772847" -> (known after apply)
      ~ triggers = {
          - "build_number" = "2022-10-13T15:04:52Z"
        } -> (known after apply) # forces replacement
    }

Plan: 9 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ catapp_ip  = "http://" -> (known after apply)
  ~ catapp_url = "http://williamy-meow.centralus.cloudapp.azure.com" -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 1 of 4 estimated
           $9.3/mo +$9.3

```

</details>

*Pusher: @William-Hashicorp, Action: `pull_request`*